app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 2, 3)
select count(*) as aggregate from `questions`
---
    public function index()

    {

        $questions = Question::with('user')->latest()->paginate(10);